# '''
# 用户身份验证
# '''
#
# 用户名 = input('请输入用户名:')
# 密码 = input('请输入密码:')
# if 用户名 == 'admin' and 密码 == '123456':
#     print('登入成功')
# else:
#     print('登入失败')

# '''
# 分段函数求值
#
#         3x - 5  (x > 1)
# f(x) =  x + 2   (-1 <= x <= 1)
#         5x + 3  (x < -1)
# '''
# x = float(input('x='))
# if x > 1:
#     y = 3 * x - 5
# elif -1 <= x <= 1:
#     y = x + 2
# else:
#     y = 5 * x + 3
# print('f(%.2f)=%.2f' % (x, y))

'''
单位换算
'''
长度 = float(input('长度='))
单位 = input('单位=')
if 单位 == 'in' or 单位 == '英寸':
    print('%f英寸 = %f厘米' % (长度, 长度 * 2.54))
elif 单位 == 'cm' or 单位 == '厘米':
    print('%f厘米 = %f英寸' % (长度, 长度 / 2.54))
else:
    print('请输入有效的单位')
